<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="shortcut icon" href="favicon.ico" type="image/x-icon">
    <title>Pirkov O.V. Houmework 3-4</title>
    <style>
        .color_div {
            width: 100px;
            height: 100px;
            margin: 10px;
            float: left;
            border: 1px solid black;
        }
    </style>
</head>
<body>
<div>
<?php

echo "<h1>Домашне завдання з PHP - Пірков Олександра Володимирович.</h1>";

echo "<h2>Робота зі ступенням та корінням.</h2>";
echo "<h1>Домашне завдання з PHP - Пірков Олександра Володимирович.</h1>";
$st = 2**10;
echo '$st = '.$st. "</br>";


echo '<p><b>Завдання №4.</b> Знайдіть  квадратний корінь із 245 (√245).</p>';
//echo '√245 = '.$a=sqrt(245) .'</br>';
echo '√245 = '.round($a) .' - округлюємо до цілого числа за правилами округлення;'.'</br>'; //округлюємо до цілого числа за правилами округлення
echo '√245 = '.round($a, 2) .' - округлюємо до числа, значання після коми 2 цифри;'. '</br>'; //округлюємо до  числа значання після коми 2 цифри
echo '√245 = '.ceil($a) .' - округлюємо до цілого числа в більшу сторону;'. '</br>'; //округлюємо до цілого числа в більшу сторону
echo '√245 = '.floor($a) .' - округлюємо до цілого числа в меншу сторону.'. '</br>'; //округлюємо до цілого числа в меншу сторону

echo '<p><b>Завдання №5.</b> Данний масив є елементами 4, 2, 5, 19, 13, 0, 10. 
Знайдіть корінь (√) із суми квадратів його елементів. Для вирішення скористуйтесь циклом foreach.</p>';

$ar = [4, 2, 5, 19, 13, 0, 10];
$sumq = 0;// создаём переменную для хранения суммы квадратов
// Используем цикл foreach для прохода по массиву и вычисления суммы квадратов
foreach ($ar as $v) {
    $sumq += $v*$v; 
}

$sqrt = sqrt($sumq);// Находим корень из суммы квадратов

echo  '√ із суми його квадратів = '.$sqrt.'</br>';
echo '√ із суми його квадратів = '.round($sqrt) .' - округлюємо до цілого числа за правилами округлення;'.'</br>'; //округлюємо до цілого числа за правилами округлення
echo '√ із суми його квадратів = '.round($sqrt, 2) .' - округлюємо до числа, значання після коми 2 цифри;'. '</br>'; //округлюємо до  числа значання після коми 2 цифри
echo '√ із суми його квадратів = '.ceil($sqrt) .' - округлюємо до цілого числа в більшу сторону;'. '</br>'; //округлюємо до цілого числа в більшу сторону
echo '√ із суми його квадратів = '.floor($sqrt) .' - округлюємо до цілого числа в меншу сторону.'. '</br>'; //округлюємо до цілого числа в меншу сторону


echo "<h2>Робота з функціями округлення.</h2>";
echo '<p><b>Завдання №6.</b> Знадіть квадратний корін із 379 (√379). Результат округліть до цілих, до десятих, до сотох.</p>'; 
$a = sqrt(379);
echo '√379 = '.$a.'</br>';
echo '√379 = '.round($a) .' - округлюємо до цілого числа за правилами округлення;'.'</br>'; 
echo '√379 = '.round($a, 1) .' - округлюємо до десятих;'. '</br>'; 
echo '√379 = '.round($a, 2) .' - округлюємо до сотих;'. '</br>'; 

echo '<p><b>Завдання №7.</b> Знадіть квадратний корін із 587 (√587). Округліть результати у більшу та меншу сторони, 
запишить результати округлення в асіціативний масив із ключами (floor) та (ceil).</p>'; 
$b = sqrt(587);
$c = ['floor' => floor($b), 'ceil' => ceil($b)];
echo '√587 = '.$b. '</br>'; 
echo '√587 = '."{$c['floor']}". ' - округлення результату за допомогою (floor);'.'</br>'; 
echo '√587 = '."{$c['ceil']}". ' - округлення результату за допомогою (ceil);'.'</br>'; 


echo "<h2>Робота з min та max.</h2>";
echo '<p><b>Завдання №8.</b> Дано числа: 4, -2, 5, 19, -130, 0, 10. Знайдіть мінімальне та максимальне число.</p>';
$e = [4, -2, 5, 19, -130, 0, 10];
$min = min($e);
$max = max($e);
echo 'Mінімальне число: '.$min. '</br>';
echo 'Mаксимальне число: '.$max. '</br>';


echo "<h2>Робота з рондомом.</h2>";
echo '<p><b>Завдання №9.</b> Виведіть на екран випадкове число від 1 до 100.</p>';
$run = mt_rand(1, 100);
echo 'Випадкове число від 1 до 100:   '.($run). '</br>';

echo '<p><b>Завдання №10.</b> Заповніть масив 10-ма випадковими числами.</p>';
$ar = [];//Создаём пустой массив
for($i = 0; $i<10; $i++){
    $rand = rand(1, 100). '</br>';//Генерируется рандомное чсло от 1 до 100 включительно
    array_push($ar, $rand); // Добавляем число в массив
}
echo 'Застосування циклу <b>for:</b>'. '</br>';
print_r($ar). '</br>';
echo  '</br>';

echo 'Застосування циклу <b>while:</b>'. '</br>';
$arWhile = [];//Создаём пустой массив
$i = 0;
while ($i <10) {
$rand = rand(1, 100). '</br>';//Генерируется рандомное чсло от 1 до 100 включительно
array_push($arWhile, $rand); // Добавляем число в массив
$i++;
}
print_r($arWhile). '</br>';

echo "<h2>Робота з модулем.</h2>";
echo '<p><b>Завдання №11.</b> Дано змінні $a і $b. Знайдіть модуль різниці $a та $b. 
Перевірте роботу скріпта самостійно для різних $a та $b.</p>';
$a = 3;
$b = 5;
$c = abs($a-$b);
echo $c. '</br>';
echo 'Робота скріпта перевірина самостійно для різних $a та $b.'. '</br>';

echo '<p><b>Завдання №12.</b> Даний масив з числами, наприклад [1, 2, -1, -2, 3, -3]. Створіть з нього новий масив
так, щоб негативні числа стали позитивними, тобто ми маємо вийти на масив: [1, 2, 1, 2, 3, 3].</p>'; 
$arra = [1, 2, -1, -2, 3, -3];
$ar = [];
$count = count($arra);//Определяем количество елементов массива

for($i = 0; $i<$count; $i++){
$ab = abs($arra[$i]);//Определяем модуль каждого числа
array_push($ar, $ab); // Добавляем число в массив
}

echo ' - При помощи функции <b>for:</b>'.'</br>';
print_r($ar).'</br>';
echo'</br>';


echo ' - При помощи функции <b>foreach:</b>'.'</br>';
$arra = [1, 2, -1, -2, 3, -3];
$ar = [];

foreach ($arra as $number) {
    $ab = abs($number); // Определяем модуль числа
    array_push($ar, $ab); // Добавляем число в новый массив
}

print_r($ar);


echo "<h2>Завдання.</h2>";
echo '<p><b>Завдання №13.</b> Дано число, наприклад 30. У цього числа є дільники - числа, на які воно ділиться без залишку. 
Дільники числа 30 - це 1, 2, 3, 5, 6, 10, 15, 30. Завдання: зробіть масив дільників нашого числа. Число може бути будь-яким, не обов`язково, 30.</p>'; 
$number = 60;
$numbeArray = [];

for ($i = 1; $i <= $number; $i++) {
    if ($number % $i === 0) {
        array_push($numbeArray, $i);// Если число делится без остатка, добавляем его в массив
    }
}

print_r($numbeArray); // Выводим массив долей


echo "<h2> Робота з str_replace.</h2>";
echo '<p><b>Завдання №14.</b> Дано рядок 31.12.2013. Замініть усі точки на дефіси.</p>';
$d ='31.12.2013';
$data = str_replace(".", "-", $d);
echo $data.'.</br>';
echo '</br>';//31-12-2013.

echo '<p> Дано рядок $str ($str = asdbnzxcasdbnmzxcv). Замініть у ній усі літери (а) на цифру 1, літири (b), на цифру 2, а літири (с), на 3.</p>';
$str = 'asdbnzxcasdbnmzxcv';
$strArray = ['a' => '1', 'b' => '2', 'c' => '3'];
$strNew = str_replace(array_keys($strArray), array_values($strArray), $str);
echo 'Заміна зроблена: '. $strNew.'.</br>';//1sd2nzx31sd2nmzx3v.

echo '<p> Дано рядок з літерами та цифрами, наприклад (1а2b3c4b5d6e7f8g9h0). Видалить із неї всі цифри. Тобто в нашому випадку повинен вийте рядок (аbcbdefgh).</p>';
$str = '1а2b3c4b5d6e7f8g9h0';
$strNew = preg_replace('/\d/', '', $str);
echo 'Всі цифри видалені: '. $strNew.'.</br>';//аbcbdefgh.

echo "<h2> Робота з strtr.</h2>";
echo '<p><b>Завдання №15.</b> Дано рядок $str ($str = asdbnzxcasdbnmzxcv). Замініть у ній усі літери (а) на цифру 1, літири (b), на цифру 2, а літири (с), на 3.
Розв`яжіть завдання двома спосабами роботи з функцією strtr (масив замін та два рядки замін).</p>';
$str = 'asdbnzxcasdbnmzxcv';
$strArray = ['a' => '1', 'b' => '2', 'c' => '3'];
$strNew = strtr($str, $strArray);
echo 'Заміна зроблена за допомогою масиву замін: '. $strNew.'.</br>';//1sd2nzx31sd2nmzx3v

$str = 'asdbnzxcasdbnmzxcv';
$abc = 'abc';
$number = '123';
$strNumber = strtr($str, $abc, $number);
echo 'Заміна зроблена за допомогою два рядки замін: '. $strNew.'.</br>';//1sd2nzx31sd2nmzx3v


echo "<h2> Робота з substr_replace.</h2>";
echo '<p><b>Завдання №16.</b> Дано рядок $str. Виріжте з неї підрядок з 3-го символу (відлік з нуля), 5 штук і замість нього вставьте (!!!).</p>';
$str = '0123456789';
$strNew = substr_replace($str, "'!!!'", 3, 5);//012'!!!'89
echo $strNew.'</br>';

echo "<h2> Робота з strpos, strrpos.</h2>";
echo '<p><b>Завдання №17.</b> Дано рядок "abc abc abc". Визначте позицію першої літери "b".</p>';
$str = 'abc abc abc';
$b = 'b';
$position = strpos($str, $b);

if($position !==false) {
    echo 'Позиція першої літери "b": '.$position.'</br>';//Позиція першої літери "b": 1
}else{
    echo 'Такої літери не має.'.$b.'</br>';
}


echo '<p><b>Завдання №18.</b> Дано рядок "abc abc abc". Визначте позицію останньої літери "b".</p>';
$str = 'abc abc abc';
$b = 'b';
$position = strrpos($str, $b);

if($position !==false) {
    echo 'Позиція останньої літери "b": '.$position.'</br>';//Позиція останньої літери "b": 9
}else{
    echo 'Такої літери не має.'.$b.'</br>';
}


echo '<p><b>Завдання №19.</b> Дано порядок "abc abc abc". Визначте позицію першої знайденої літери "b", якщо роспочати пошук не з початку рядка, а з позиції 3.</p>';
$str = 'abc abc abc';
$b = 'b';
$substring = substr($str, 3);
$position = strpos($substring, $b);

if($position !==false) {
    echo 'Літера "b" з позиції 3: '.$position.'</br>';//Літера "b" з позиції 3: 2
}else{
    echo 'Такої літери не має.'.$b.'</br>';
}


echo '<p><b>Завдання №20.</b> Дано порядок "aaa aaa aaa aaa aaa". Визначте позицію другого пропуску.</p>';
$str = 'aaa aaa aaa aaa aaa';
$probel = 2;//на тот случай, если мы захатим менять условия по пробелам
$position = -1;

for($i = 0; $i<$probel; $i++) {
    $position = strpos($str, ' ', $position + 1);

    if($position === false) {
        echo 'Пропусків немає.'.'</br>';
        break; // Якщо пропуск не знайдено, виходимо з циклу
    }
}
    if ($position !== false) {
        echo 'Позиція другого пропуску: '.$position.'</br>';//Позиція другого пропуску: 7
    }


echo '<p><b>Завдання №21.</b> Перевірте, чи в рядку є дві точки поспіль. Якщо це так - виведіть "є", якщо не так - "ні".</p>';
$str = 'Перевірте, чи в рядку є дві точки поспіль. Якщо це так - виведіть "є", якщо не так - "ні".';
$strDots = 'Тут є дві точки поспіль..';
$strTwo = '..';
$strnew = strpos($str, $strTwo);      //ні
if($strnew !==false) {
    echo $str.'  -'.'<b>є</b>'.'</br>';
}else{
    echo $str.'  -'.'<b>ні</b>'.'</br>';
}

$strnew = strpos($strDots, $strTwo);   //є
if($strnew !==false) {
    echo $strDots.'  -'.'<b>є</b>'.'</br>';
}else{
    echo $strDots.'  -'.'<b>ні</b>'.'</br>';
}


echo '<p><b>Завдання №22.</b> Перевірте, чи  рядкок починається на http://. Якщо це так - виведить "так", якщо не так - "ні".</p>';
$address = 'http://.';
if(strpos($address, 'http://') ===0){
    echo 'так';                          //так
}else{
    echo 'ні';
}


echo "<h2> Робота з axplode, implode.</h2>";
echo '<p><b>Завдання №23.</b> Дано рядок (html, css, php). За допомогою функції explode запишить кожне слово рядка в окремий елемент масиву.</p>';
$str = 'html, css, php';
$ar = explode("," , $str);
print_r($ar).'</br>';//Array ( [0] => html [1] => css [2] => php )

echo '<p><b>Завдання №24.</b> Даний масив з елементами (html, css, php). За допомогою функції implode створіть рядок із ціх елемнтів, розділених комами.</p>';
$ar = ["html", "css", "php"];
$str = implode(", ", $ar);
echo $str.'</br>';//html, css, php

echo '<p><b>Завдання №25.</b> У змінній $date лежить дата у форматі "2013-12-31". Перетворіть цю дату на формат "31.12.2013".</p>';
$date = '2013-12-31';
$dataParts = explode('-', $date);
$reversedDate = implode('.', array_reverse($dataParts));
echo $reversedDate.'</br>';//31.12.2013


echo "<h2> Робота з str_split.</h2>";
echo '<p><b>Завдання №26.</b> Дано рядок "1234567890". Розбийте її на масив з елементами 12, 34, 56, 78 90.</p>';
$str = '1234567890';
$ar = str_split($str, 2);
print_r($ar).'</br>';//Array ( [0] => 12 [1] => 34 [2] => 56 [3] => 78 [4] => 90 )

echo '<p><b>Завдання №27.</b> Дано рядок "1234567890". Розбийте її на масив з елементами 1,2,3,4,5,6,7,8,9,0.</p>';
$str = '1234567890';
$ar = str_split($str);
print_r($ar).'</br>';//Array ( [0] => 1 [1] => 2 [2] => 3 [3] => 4 [4] => 5 [5] => 6 [6] => 7 [7] => 8 [8] => 9 [9] => 0 )

echo '<p><b>Завдання №28.</b> Дано рядок "1234567890". Зробіть з неї рядок 12-34-56-78-90, не використовуючи цикл.</p>';
$str = '1234567890';
$ar = str_split($str, 2);
$strnew = implode('-', $ar);
echo ($strnew).'</br>';//12-34-56-78-90


echo "<h2> Робота з trim, ltrim, rtrim.</h2>";
echo '<p><b>Завдання №29.</b> Дано рядок. Очистіть її від кінцевих прогалин.</p>';
$str = '  Стрічка очисчена від кінцевих прогалин.  ';
$rim = trim($str);
echo $rim.'</br>';//Очистіть її від кінцевих прогалин.

echo '<p><b>Завдання №30.</b> Дано рядок /php/. Зроіть з неї рядок "php", видаливши кінцеві сліші.</p>';
$str = '/php/';
$rim = trim($str, "/");
echo $rim.'</br>';//php

echo '<p><b>Завдання №31.</b> Дано рядок "слова слова слова.". На прикінці цого рядка може бути точка, а може й не бути. 
Зробіть так, щоб на прикінці цого рядка гарантовано стояла крапка. Тобто: якщо цієї точки не має - її треба додати, а якщо є -
нічого не треба. Завдання вірішить через <b>trim</b> без жодніх іфів.</p>';
$str = 'слова слова слова.';
$rim = rtrim($str, ".");
$rim .= '.';
echo $rim.'</br>';//слова слова слова.


echo "<h2> Робота з strrev.</h2>";
echo '<p><b>Завдання №32.</b> Дано рядок 12345. Зробіть із неї рядок 54321.</p>';
$str = '12345';
$strre = strrev($str);
echo $strre.'</br>';//54321

echo '<p><b>Завдання №33.</b> Перевірте, чи є слово <b>поліндром</b> (однаково читається у всіх напрямках, приклади таких слов: <b>madam, otto, kayak, nun, level</b>.</p>';
$madam = 'madam';
$madamrev = strrev($madam);
$otto = 'otto';
$ottorev = strrev($otto);
$kayak = 'kayak';
$kayakrev = strrev($kayak);
$nun = 'nun';
$nunrev = strrev($nun);
$level = 'level';
$levelrev = strrev($level);

 function isPalindrome($word) {
     $reversed = strrev($word);
     return $word === $reversed;
 }


if (isPalindrome($madamrev)) {
    echo "$madam  - полиндром;\n";//madam - полиндром
} else {
    echo "$madam  - не полиндром;\n";
}

if (isPalindrome($ottorev)) {
    echo "$otto - полиндром;\n";//otto - полиндром;
} else {
    echo "$otto - не полиндром;\n";
}

if (isPalindrome($kayakrev)) {
    echo "$kayak - полиндром;\n";//kayak - полиндром;
} else {
    echo "$kayak - не полиндром;\n";
}

if (isPalindrome($nunrev)) {
    echo "$nun - полиндром;\n";//nun - полиндром;
} else {
    echo "$nun - не полиндром;\n";
}

if (isPalindrome($levelrev)) {
    echo "$level - полиндром;\n";//level - полиндром;
} else {
    echo "$level - не полиндром;\n";
}


echo "<h2> Робота з str_shuffle.</h2>";
echo '<p><b>Завдання №34.</b> Дано рядок. Перемішайте символи цього рядка у випадковому порядку.</p>';
$str = 'Shuffle all the words';
$shuffled = str_shuffle($str);
echo $shuffled.'</br>';//h lfste urehwlSoaldf кожного разу буде порізному

echo '<p><b>Завдання №35.</b> Створіть рядок із 6-ти випадкових маленьких латинських літер так, щоб літери не повторювалися.
Потрібно зробити так, щоб у нашому рядку могла бути будь яка латинська літера, а не обмежений набір.</p>';

function generateRandomString($length) {
    $alphabet = 'abcdefghijklmnopqrstuvwxyz';
    $alphabetLength = strlen($alphabet);
    $randomString = '';
    
    for ($i = 0; $i < $length; $i++) {
        $randomChar = $alphabet[rand(0, $alphabetLength - 1)];//Определяем рандомно любую букву алфавита
        $randomString .= $randomChar;//Добавляем рандомно полученную букву в строку, которая затем будет выведена в раузер
        
        // Видаліть обрану літеру із набору символів, щоб виключити її повторну случайну появу при слдуючий ітерації
        $alphabet = str_replace($randomChar, '', $alphabet);
        $alphabetLength = strlen($alphabet);
    }
    
    return $randomString;
}

$randomString = generateRandomString(6);//кількість букв у нашому рядку
echo $randomString;//szynpt - кожного разу будуть інші букви


echo "<h2> Робота з number_format.</h2>";
echo '<p><b>Завдання №36.</b> Дано рядок "12345678". Зробіть з неї рядок "12,345,678".</p>';
$str = '12345678';
$number = number_format($str);
echo $number.'</br>';//12,345,678


echo "<h2> Робота з str_repeat.</h2>";
echo '<p><b>Завдання №37.</b> Намалюйте піраміду, як показано на малюнку, тільки у Вашої піраміди має бути 9 рядків, а не 5.
Розв`яжіть задачу за допомогою <b>одного цикла</b> та функції <b>str_repeat</b>.</p>';
$x = 'X';
for($i=0; $i<=9; $i++){
    $piramida = str_repeat($x, $i);
    echo $piramida.'</br>';
    // X
    // XX
    // XXX
    // XXXX
    // XXXXX
    // XXXXXX
    // XXXXXXX
    // XXXXXXXX
    // XXXXXXXXX
}

echo '<p><b>Завдання №38.</b> Намалюйте піраміду, як показано на малюнку. Розв`яжіть задачу за допомогою <b>одного циклу</b> та функції <b>str_repeat</b>.</p>';
$number = '0';
for($i=0; $i<=9; $i++){
    $piramida = str_repeat($number++, $i);
    echo $piramida.'</br>';
    // 1
    // 22
    // 333
    // 4444
    // 55555
    // 666666
    // 7777777
    // 88888888
    // 999999999
}


echo "<h2> Робота з strip_tags та htmlspecialchars.</h2>";
echo '<p><b>Завдання №39.</b> Дано рядок html, <b>php</b>, js. Видалити теги з цього рядка.</p>';
$str = 'html, <b>php</b>, js';
$deleteTeg = strip_tags($str);
echo $deleteTeg.'</br>';//html, php, js

echo '<p><b>Завдання №40.</b> Дано рядок $str. Видалить усі теги з цього рядка, крім тегів b та i.</p>';
$str = '<p>html, <b>php</b>, <i>js</i></p>';
$allowe_tags = "<b>, <i>";
$deleteTeg = strip_tags($str, $allowe_tags);
echo $deleteTeg.'</br>';

echo '<p><b>Завдання №41.</b> Дано рядок html, <b>php</b>, js. Виведіть її на екран "як є": тобто браузер не повинен перетворювати тег b на жирний.</p>';
$str = htmlspecialchars('html, <b>php</b>, js');
echo $str.'</br>';


echo "<h2> Робота з chr та ord.</h2>";
echo '<p><b>Завдання №42.</b> Дізнайтеся код символів: "а", "b", "с", <b>пробілу</b>.</p>';
$a = 'a';
$b = 'b';
$c = 'c';
$probil = ' ';
$numberA = ord($a);
echo 'Код символа "а" - '.$numberA.'</br>';//97
$numberB = ord($b);
echo 'Код символа "b" - '.$numberB.'</br>';//98
$numberC = ord($c);
echo 'Код символа "c" - '.$numberC.'</br>';//99
$number_probil = ord($probil);
echo 'Код символа "пробілу" - '.$number_probil.'</br>';//32

echo '<p><b>Завдання №43.</b> Вивчить таблицю <b>ASCII</b>. Визначить межі, в яких розтошовуються літери англійської абетки.</p>';
$alphabet = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z"];
$array = [];

foreach ($alphabet as $str) {
    $number = ord($str);
    array_push($array, $number);
}
$str_number = implode("; ", $array);
echo 'Межі, в яких розтошовуються літери англійської абетки -  '.$str_number.'</br>';//97; 98; 99; 100; 101; 102; 103; 104; 105; 106; 107; 108; 109; 110; 111; 112; 113; 114; 115; 116; 117; 118; 119; 120; 121; 122
//print_r($array);


echo '<p><b>Завдання №44.</b> Виведіть на екран символ із кодом 33.</p>';
$number = 33;
$letter = chr($number);
echo 'Символ із кодом 33 - '.$letter.'</br>';//!

echo '<p><b>Завдання №45.</b> Запишіть у змінну $str випадковий символ - велику букву латинського алфавіту. Підказка: за допомогою таблиці
ASCII визначте, які цілі числа відповідають велеким буквам латинського алфавіту.</p>';
$num = mt_rand(65, 90);
$str = chr($num);
echo 'Випадкова велика буква латинського алфавіту -  '.$str.'</br>';//L кожного разу буде різна літера

echo '<p><b>Завдання №46.</b> Запишіть у змінну $str випадковий рядок $len довжиною, що складаеться з маленьких букву латинського алфавіту. 
Підказка: скористайтеся циклом <b>for</b> або <b>while</b>.</p>';
$len = 10;

for($i=0; $i<$len; $i++) {
    $num = mt_rand(97, 122);//рандомно определяем числовое значение буквы (цифру)
    $str = chr($num);//переводим числовой код в букву
    echo $str;//omuwrdtyfy - каждый раз будут рандомно меняться буквы
}

echo '<p><b>Завдання №47.</b> Дано букву англійського алфавиту. Дізнайтеся, вона маленька, чи велика?</p>';
$letter = "f";
$num = ord($letter);

if (65 <= $num && $num <= 90) {
    echo 'Буква велика - '.chr($num).'</br>';
}else if(97 <= $num && $num <= 122) {
    echo 'Буква маленька - '.chr($num).'</br>';
}else{
    echo 'Ви помилились - ввеіть будь ласка латинську літеру'.'</br>';
}


echo "<h2> Робота з strchr, strrchr.</h2>";
echo '<p><b>Завдання №48.</b> Дано рядок "ab-cd-ef". За допомогою функції strchr виведіть на екран рядок "-cd-ef".</p>';
$str = 'ab-cd-ef';
$a = strchr($str, '-');
echo $a.'</br>';//-cd-ef

echo '<p><b>Завдання №49.</b> Дано рядок "ab-cd-ef". За допомогою функції strrchr виведіть на екран рядок "-ef".</p>';
$str = 'ab-cd-ef';
$a = strrchr($str, '-');
echo $a.'</br>';//-ef

echo "<h2> Робота з strstr.</h2>";
echo '<p><b>Завдання №50.</b> Дано рядок "ab-cd-ef". За допомогою функції strstr виведіть на екран рядок "--cd--ef".</p>';
$string = "ab-cd-ef";
$substring = strstr($string, '-');
$a = str_replace('-', '--', $substring);
echo $a.'</br>';//--cd--ef


echo "<h2> Завдання.</h2>";
echo '<p><b>Завдання №51.</b> Перетворіть рядок "var_test_text" на "varТestТext". Скрипт, звичайно, повинен працювати з будь-якими аналогічними рядками.</p>';
$string = 'var_test_text';
$array = explode('_', $string);

for ($i = 0; $i < count($array); $i++) {
    if ($i > 0) {
        $array[$i] = ucfirst($array[$i]);
    }
}
$result = implode('', $array);
echo $result; // varTestText

echo '<p><b>Завдання №52.</b> Даний масив із числами. Виведіть на екран усі числа, у яких є цифра 3.</p>';
$length = 100; // Кінець діапазону

for ($i = 0; $i <= $length; $i++) {
    $number = $i;
    if (strpos($number, '3') !== false) {
        echo $i . ' - містить цифру 3.<br>';
    }
}


echo "<h2> Додаткове завдвння на зірочку з підручника - Створення вебдодатків за допомогою PHP та СУБД MySQL.</h2>";
echo '<p><b>Завдання №51*.</b>	Написати PHP скрипт, в якому створити масив з назвами кольорів. Кількість різних кольорів повинна бути 
більша чотирьох. Потім за допомогою PHP відобразити на сторінці чотири div однакового розміру. Зробити так, щоб при завантаженні 
сторінки всі чотири div заливались випадковими кольорами, обраними з масиву. При цьому, всі чотири div повинні заливатись різними 
кольорами. Жоден колір не повинен повторюватись.</p>';

$div = ["red", "yellow", "green", "blue", "brown", "black"];
$usedColors = []; // Масив для зберігання вже використаних кольорів

for ($i = 0; $i < 4; $i++) {
    // Генеруємо випадковий індекс для вибору кольору з масиву $div
    $randomIndex = array_rand($div);
    
    // Перевіряємо, чи цей колір вже був використаний, якщо так, то ми генеруємо новий випадковий індекс, поки не отримаємо колір, який ще не був використаний
    while (in_array($div[$randomIndex], $usedColors)) {
        $randomIndex = array_rand($div);
    }
    
    // Додаємо цей колір до масиву використаних кольорів
    $usedColors[] = $div[$randomIndex];
    
    // Виводимо div з вибраним кольором, встановлюючи фоновий колір змінної $div[$randomIndex]
    echo '<div class="color_div" style="background-color:' . $div[$randomIndex] . '"></div>';
}





?>
</div>
</body>
</html>